micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_pwr.h
/**
  ******************************************************************************
  * @file    stm32n6xx_ll_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_LL_PWR_H
#define STM32N6xx_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx.h"

/** @addtogroup STM32N6xx_LL_Driver
  * @{
  */

#if defined (PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/

/** @defgroup PWR_LL_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup PWR_LL_WAKEUP_PIN_OFFSET Wake-Up Pins register offsets Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
/* Wake-Up Pins PWR register offsets */
#define LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET    (2UL)
#define LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK       (0x1FU)
/**
  * @}
  */

/**
  * @}
  */


/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_EC_SUPPLY_PWR Power supply source configuration
  * @{
  */
#define LL_PWR_SMPS_SUPPLY             PWR_CR1_SDEN                            /*!< Core domains are supplied from the SMPS                                     */
#define LL_PWR_EXTERNAL_SOURCE_SUPPLY  (0U)                                    /*!< The SMPS is Bypassed. The Core domains are supplied from an external source */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SUPPLY_PWR Power supply source configuration
  * @{
  */
#define LL_PWR_VCOREMON_LEVEL_SCALE1  (0U)                                     /*!< VDDCORE low-voltage threshold 1 selected (VOS 1) */
#define LL_PWR_VCOREMON_LEVEL_SCALE0  PWR_CR3_VCORELLS                         /*!< VDDCORE low-voltage threshold 2 selected (VOS 0) */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_REGU_VOLTAGE Run mode Regulator Voltage Scaling
  * @{
  */
#define LL_PWR_REGU_VOLTAGE_SCALE0     PWR_VOSCR_VOS                           /*!< Voltage scaling range 0 (highest frequency) */
#define LL_PWR_REGU_VOLTAGE_SCALE1     (0U)                                    /*!< Voltage scaling range 1 (lowest power)      */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_MODE_PWR Power Down Mode In Deep Sleep Mode
  * @{
  */
#define LL_PWR_POWERDOWN_MODE_DS_STOP     (0U)                                 /*!< Enter to Stop mode when the CPU enters deepsleep    */
#define LL_PWR_POWERDOWN_MODE_DS_STANDBY  PWR_CPUCR_PDDS                       /*!< Enter to Standby mode when the CPU enters deepsleep */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_STOP_MODE_REGU_VOLTAGE Stop mode Regulator Voltage Scaling
  * @{
  */
#define LL_PWR_REGU_STOP_VOLTAGE_SCALE3     PWR_CPUCR_SVOS                     /*!< Voltage scaling range 3 (highest frequency) when system enters STOP mode */
#define LL_PWR_REGU_STOP_VOLTAGE_SCALE5     (0U)                               /*!< Voltage scaling range 5 (lowest power) when system enters STOP mode      */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_VDDIO_VOLTAGE_RANGE VDD I/O voltage range selection
  * @{
  */
#define LL_PWR_VDDIO_VOLTAGE_RANGE_1V8    (1U)                                 /*!< 1v8 voltage range */
#define LL_PWR_VDDIO_VOLTAGE_RANGE_3V3    (0U)                                 /*!< 3v3 voltage range  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PIN  Wakeup Pins
  * @{
  */
#define LL_PWR_WAKEUP_PIN1             PWR_WKUPEPR_WKUPEN1                     /*!< Wake-Up pin 1 : PA0  */
#define LL_PWR_WAKEUP_PIN2             PWR_WKUPEPR_WKUPEN2                     /*!< Wake-Up pin 2 : PA2  */
#define LL_PWR_WAKEUP_PIN3             PWR_WKUPEPR_WKUPEN3                     /*!< Wake-Up pin 3 : PC13 */
#define LL_PWR_WAKEUP_PIN4             PWR_WKUPEPR_WKUPEN4                     /*!< Wake-Up pin 4 : PD2  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PIN_PULL  Wakeup Pins pull configuration
  * @{
  */
#define LL_PWR_WAKEUP_PIN_NOPULL       (0UL)                                   /*!< Configure Wake-Up pin in no pull   */
#define LL_PWR_WAKEUP_PIN_PULLUP       (1UL)                                   /*!< Configure Wake-Up pin in pull Up   */
#define LL_PWR_WAKEUP_PIN_PULLDOWN     (2UL)                                   /*!< Configure Wake-Up pin in pull Down */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_ITEMS_PRIVILEGE_ATTRIBUTE PWR Items Privilege Attribute
  * @{
  */
#define LL_PWR_PRIV0_NPRIV             (0U)                                    /*!< System supply configuration non privilege mode                       */
#define LL_PWR_PRIV0_PRIV              PWR_PRIVCFGR_PRIV0                      /*!< System supply configuration privilege mode                           */
#define LL_PWR_PRIV1_NPRIV             (0U)                                    /*!< Programmable voltage detector non privilege mode                     */
#define LL_PWR_PRIV1_PRIV              PWR_PRIVCFGR_PRIV1                      /*!< Programmable voltage detect privilege mode                           */
#define LL_PWR_PRIV2_NPRIV             (0U)                                    /*!< VDDCORE monitor non privilege mode                                   */
#define LL_PWR_PRIV2_PRIV              PWR_PRIVCFGR_PRIV2                      /*!< VDDCORE monitor privilege mode                                       */
#define LL_PWR_PRIV3_NPRIV             (0U)                                    /*!< I-TCM, D-TCM, and I-TCM FLEXMEM low power control non privilege mode */
#define LL_PWR_PRIV3_PRIV              PWR_PRIVCFGR_PRIV3                      /*!< I-TCM, D-TCM, and I-TCM FLEXMEM low power control privilege mode     */
#define LL_PWR_PRIV4_NPRIV             (0U)                                    /*!< Voltage scaling selection nprivilege mode                            */
#define LL_PWR_PRIV4_PRIV              PWR_PRIVCFGR_PRIV4                      /*!< Voltage scaling selection privilege mode                             */
#define LL_PWR_PRIV5_NPRIV             (0U)                                    /*!< Backup domain non privilege mode                                     */
#define LL_PWR_PRIV5_PRIV              PWR_PRIVCFGR_PRIV5                      /*!< Backup domain privilege mode                                         */
#define LL_PWR_PRIV6_NPRIV             (0U)                                    /*!< CPU power control non privilege mode                                 */
#define LL_PWR_PRIV6_PRIV              PWR_PRIVCFGR_PRIV6                      /*!< CPU power control privilege mode                                     */
#define LL_PWR_PRIV7_NPRIV             (0U)                                    /*!< Peripheral voltage monitor non privilege mode                        */
#define LL_PWR_PRIV7_PRIV              PWR_PRIVCFGR_PRIV7                      /*!< Peripheral voltage monitor privilege mode                            */
#define LL_PWR_WAKEUP_PIN1_NPRIV       (0U)                                    /*!< Wake up pin 1 non privilege mode                                     */
#define LL_PWR_WAKEUP_PIN1_PRIV        PWR_PRIVCFGR_WKUPPRIV1                  /*!< Wake up pin 1 privilege mode                                         */
#define LL_PWR_WAKEUP_PIN2_NPRIV       (0U)                                    /*!< Wake up pin 2 non privilege mode                                     */
#define LL_PWR_WAKEUP_PIN2_PRIV        PWR_PRIVCFGR_WKUPPRIV2                  /*!< Wake up pin 2 privilege mode                                         */
#define LL_PWR_WAKEUP_PIN3_NPRIV       (0U)                                    /*!< Wake up pin 3 non privilege mode                                     */
#define LL_PWR_WAKEUP_PIN3_PRIV        PWR_PRIVCFGR_WKUPPRIV3                  /*!< Wake up pin 3 privilege mode                                         */
#define LL_PWR_WAKEUP_PIN4_NPRIV       (0U)                                    /*!< Wake up pin 4 non privilege mode                                     */
#define LL_PWR_WAKEUP_PIN4_PRIV        PWR_PRIVCFGR_WKUPPRIV4                  /*!< Wake up pin 4 privilege mode                                         */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_ITEMS_SECURE_ATTRIBUTE PWR Items Secure Attribute
  * @{
  */
#define LL_PWR_SEC0_NSEC               (0U)                                    /*!< System supply configuration non secure mode                       */
#define LL_PWR_SEC0_SEC                PWR_SECCFGR_SEC0                        /*!< System supply configuration secure mode                           */
#define LL_PWR_SEC1_NSEC               (0U)                                    /*!< Programmable voltage detector non secure mode                     */
#define LL_PWR_SEC1_SEC                PWR_SECCFGR_SEC1                        /*!< Programmable voltage detect secure mode                           */
#define LL_PWR_SEC2_NSEC               (0U)                                    /*!< VDDCORE monitor non secure mode                                   */
#define LL_PWR_SEC2_SEC                PWR_SECCFGR_SEC2                        /*!< VDDCORE monitor secure mode                                       */
#define LL_PWR_SEC3_NSEC               (0U)                                    /*!< I-TCM, D-TCM, and I-TCM FLEXMEM low power control non secure mode */
#define LL_PWR_SEC3_SEC                PWR_SECCFGR_SEC3                        /*!< I-TCM, D-TCM, and I-TCM FLEXMEM low power control secure mode     */
#define LL_PWR_SEC4_NSEC               (0U)                                    /*!< Voltage scaling selection nsecure mode                            */
#define LL_PWR_SEC4_SEC                PWR_SECCFGR_SEC4                        /*!< Voltage scaling selection secure mode                             */
#define LL_PWR_SEC5_NSEC               (0U)                                    /*!< Backup domain non secure mode                                     */
#define LL_PWR_SEC5_SEC                PWR_SECCFGR_SEC5                        /*!< Backup domain secure mode                                         */
#define LL_PWR_SEC6_NSEC               (0U)                                    /*!< CPU power control non secure mode                                 */
#define LL_PWR_SEC6_SEC                PWR_SECCFGR_SEC6                        /*!< CPU power control secure mode                                     */
#define LL_PWR_SEC7_NSEC               (0U)                                    /*!< Peripheral voltage monitor non secure mode                        */
#define LL_PWR_SEC7_SEC                PWR_SECCFGR_SEC7                        /*!< Peripheral voltage monitor secure mode                            */
#define LL_PWR_WAKEUP_PIN1_NSEC        (0U)                                    /*!< Wake up pin 1 non secure mode                                     */
#define LL_PWR_WAKEUP_PIN1_SEC         PWR_SECCFGR_WKUPSEC1                    /*!< Wake up pin 1 secure mode                                         */
#define LL_PWR_WAKEUP_PIN2_NSEC        (0U)                                    /*!< Wake up pin 2 non secure mode                                     */
#define LL_PWR_WAKEUP_PIN2_SEC         PWR_SECCFGR_WKUPSEC2                    /*!< Wake up pin 2 secure mode                                         */
#define LL_PWR_WAKEUP_PIN3_NSEC        (0U)                                    /*!< Wake up pin 3 non secure mode                                     */
#define LL_PWR_WAKEUP_PIN3_SEC         PWR_SECCFGR_WKUPSEC3                    /*!< Wake up pin 3 secure mode                                         */
#define LL_PWR_WAKEUP_PIN4_NSEC        (0U)                                    /*!< Wake up pin 4 non secure mode                                     */
#define LL_PWR_WAKEUP_PIN4_SEC         PWR_SECCFGR_WKUPSEC4                    /*!< Wake up pin 4 secure mode                                         */
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */

/** @defgroup PWR_LL_EF_Configuration PWR Configuration
  * @{
  */

/**
  * @brief  Configure the PWR supply
  * @rmtoll CR1       SDEN             LL_PWR_ConfigSupply
  * @param  SupplySource This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_SUPPLY
  *         @arg @ref LL_PWR_EXTERNAL_SOURCE_SUPPLY
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ConfigSupply(uint32_t SupplySource)
{
  /* Set the power supply configuration */
  MODIFY_REG(PWR->CR1, PWR_CR1_SDEN, SupplySource);
}

/**
  * @brief  Get the PWR supply
  * @rmtoll CR1       SDEN             LL_PWR_GetSupply
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_SUPPLY
  *         @arg @ref LL_PWR_EXTERNAL_SOURCE_SUPPLY
  */
__STATIC_INLINE uint32_t LL_PWR_GetSupply(void)
{
  /* Get the power supply configuration */
  return READ_BIT(PWR->CR1, PWR_CR1_SDEN);
}

/**
  * @brief  Enable the SMPS low-power mode.
  * @rmtoll CR1        LPDS08V         LL_PWR_EnableSMPSLPMode
  * @note This bit is used to keep the SMPS in PWM mode (MR)
  * in Stop SVOS 3.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSMPSLPMode(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_LPDS08V);
}

/**
  * @brief  Disable the SMPS low-power mode.
  * @rmtoll CR1        LPDS08V         LL_PWR_DisableSMPSLPMode
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSMPSLPMode(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_LPDS08V);
}

/**
  * @brief  Check if the SMPS low-power mode is enabled.
  * @rmtoll CR1        LPDS08V         LL_PWR_IsEnabledSMPSLPMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSMPSLPMode(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_LPDS08V) == (PWR_CR1_LPDS08V)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the pull down on output voltage during power-down mode.
  * @rmtoll CR2        MODE_PDN         LL_PWR_EnablePullDown
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePullDown(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_MODE_PDN);
}

/**
  * @brief  Disable the pull down on output voltage during power-down mode.
  * @rmtoll CR1        MODE_PDN         LL_PWR_DisablePullDown
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePullDown(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_MODE_PDN);
}

/**
  * @brief  Check if the pull down on output voltage during power-down mode is enabled.
  * @rmtoll CR1        MODE_PDN         LL_PWR_IsEnabledPullDown
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPullDown(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_MODE_PDN) == (PWR_CR1_MODE_PDN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the pwr_on pulse low time
  * @rmtoll CR1        POPL            LL_PWR_SetPwrONPulseLowTime
  * @param  PulseTime Value between Min_Data = 0 and Max_Data = 31
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPwrONPulseLowTime(uint32_t PulseTime)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_POPL, (PulseTime << PWR_CR1_POPL_Pos));
}

/**
  * @brief  Get the pwr_on pulse low time
  * @rmtoll CR1        POPL            LL_PWR_GetPwrONPulseLowTime
  * @retval Value between Min_Data = 0 and Max_Data = 31
  */
__STATIC_INLINE uint32_t LL_PWR_GetPwrONPulseLowTime(void)
{
  return (uint32_t)(READ_BIT(PWR->CR1, PWR_CR1_POPL) >> PWR_CR1_POPL_Pos);
}

/**
  * @brief  Enable Power Voltage Detector
  * @rmtoll CR2        PVDEN           LL_PWR_EnablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePVD(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_PVDEN);
}

/**
  * @brief  Disable Power Voltage Detector
  * @rmtoll CR2        PVDEN           LL_PWR_DisablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePVD(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_PVDEN);
}

/**
  * @brief  Check if Power Voltage Detector is enabled
  * @rmtoll CR2        PVDEN           LL_PWR_IsEnabledPVD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPVD(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_PVDEN) == (PWR_CR2_PVDEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable VCORE monitoring
  * @rmtoll CR3        VCOREMONEN      LL_PWR_EnableVCOREMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVCOREMonitoring(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_VCOREMONEN);
}

/**
  * @brief  Disable VCORE monitoring
  * @rmtoll CR3        VCOREMONEN      LL_PWR_DisableVCOREMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVCOREMonitoring(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_VCOREMONEN);
}

/**
  * @brief  Check if the VCORE monitoring is enabled
  * @rmtoll CR3        VCOREMONEN      LL_PWR_IsEnabledVCOREMonitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVCOREMonitoring(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_VCOREMONEN) == (PWR_CR3_VCOREMONEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the VDDCORE voltage detector low-level selection
  * @rmtoll CR3        VCORELLS        LL_PWR_SetVCORELowLevelDetection
  * @param  Lowlevel This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VCOREMON_LEVEL_SCALE1
  *         @arg @ref LL_PWR_VCOREMON_LEVEL_SCALE0
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetVCORELowLevelDetection(uint32_t Lowlevel)
{
  MODIFY_REG(PWR->CR3, PWR_CR3_VCORELLS, Lowlevel);
}

/**
  * @brief  Get the VDDCORE voltage detector low-level selection
  * @rmtoll CR3        VCORELLS        LL_PWR_GetVCORELowLevelDetection
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_VCOREMON_LEVEL_SCALE1
  *         @arg @ref LL_PWR_VCOREMON_LEVEL_SCALE0
  */
__STATIC_INLINE uint32_t LL_PWR_GetVCORELowLevelDetection(void)
{
  return (uint32_t)(READ_BIT(PWR->CR3, PWR_CR3_VCORELLS));
}

/**
  * @brief  Enable I-TCM and D-TCM RAMs retention in Standby mode.
  * @rmtoll CR4        TCMRBSEN        LL_PWR_EnableTCMSBRetention
  * @note   When this bit is set, I-TCM and D-TCM RAMs are supplied
  *         from backup regulator in Standby mode.
  *         When this bit is reset, I-TCM and D-TCM RAMs can still
  *         be used in Run and Stop modes, but their content is lost
  *         in Standby mode.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableTCMSBRetention(void)
{
  SET_BIT(PWR->CR4, PWR_CR4_TCMRBSEN);
}

/**
  * @brief  Disable I-TCM and D-TCM RAMs retention in Standby mode.
  * @rmtoll CR4        TCMRBSEN        LL_PWR_DisableTCMSBRetention
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableTCMSBRetention(void)
{
  CLEAR_BIT(PWR->CR4, PWR_CR4_TCMRBSEN);
}

/**
  * @brief  Check if the I-TCM and D-TCM RAMs retention in Standby mode is enabled
  * @rmtoll CR4        TCMRBSEN          LL_PWR_IsEnabledTCMSBRetention
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledTCMSBRetention(void)
{
  return ((READ_BIT(PWR->CR4, PWR_CR4_TCMRBSEN) == (PWR_CR4_TCMRBSEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable I-TCM FLEXMEM retention in Standby mode.
  * @rmtoll CR4        TCMFLXRBSEN     LL_PWR_EnableTCMFLXSBRetention
  * @note   When this bit is set, the I-TCM FLEXMEM is supplied
  *         from backup regulator in Standby mode.
  *         When this bit is reset, the I-TCM FLEXMEM can still
  *         be used in Run and Stop modes, but its content is lost
  *         in Standby mode.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableTCMFLXSBRetention(void)
{
  SET_BIT(PWR->CR4, PWR_CR4_TCMFLXRBSEN);
}

/**
  * @brief  Disable I-TCM FLEXMEM RAMs retention in Standby mode.
  * @rmtoll CR4        TCMFLXRBSEN     LL_PWR_DisableTCMFLXSBRetention
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableTCMFLXSBRetention(void)
{
  CLEAR_BIT(PWR->CR4, PWR_CR4_TCMFLXRBSEN);
}

/**
  * @brief  Check if the I-TCM FLEXMEM retention in Standby mode is enabled
  * @rmtoll CR4        TCMFLXRBSEN     LL_PWR_IsEnabledTCMFLXSBRetention
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledTCMFLXSBRetention(void)
{
  return ((READ_BIT(PWR->CR4, PWR_CR4_TCMFLXRBSEN) == (PWR_CR4_TCMFLXRBSEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the main internal Regulator output voltage
  * @rmtoll VOSCR       VOS            LL_PWR_SetRegulVoltageScaling
  * @param  VoltageScaling This parameter can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE0
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRegulVoltageScaling(uint32_t VoltageScaling)
{
  MODIFY_REG(PWR->VOSCR, PWR_VOSCR_VOS, VoltageScaling);
}

/**
  * @brief  Get the main internal Regulator output voltage. Reflecting the last
  *         VOS value applied to the PMU.
  * @rmtoll VOSCR       ACTVOS         LL_PWR_GetRegulVoltageScaling
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE0
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
  */
__STATIC_INLINE uint32_t LL_PWR_GetRegulVoltageScaling(void)
{
  return ((READ_BIT(PWR->VOSCR, PWR_VOSCR_ACTVOS) == (PWR_VOSCR_ACTVOS)) ? 1UL : 0UL);
}

/**
  * @brief  Enable VBAT and Temperature monitoring
  * @rmtoll BDCR1      MONEN           LL_PWR_EnableMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableMonitoring(void)
{
  SET_BIT(PWR->BDCR1, PWR_BDCR1_MONEN);
}

/**
  * @brief  Disable VBAT and Temperature monitoring
  * @rmtoll BDCR1      MONEN           LL_PWR_DisableMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableMonitoring(void)
{
  CLEAR_BIT(PWR->BDCR1, PWR_BDCR1_MONEN);
}

/**
  * @brief  Check if the VBAT and Temperature monitoring is enabled
  * @rmtoll BDCR1      MONEN           LL_PWR_IsEnabledMonitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledMonitoring(void)
{
  return ((READ_BIT(PWR->BDCR1, PWR_BDCR1_MONEN) == (PWR_BDCR1_MONEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable BKPSRAM retention in Standby mode.
  * @rmtoll BDCR2      BKPRBSEN        LL_PWR_EnableBkpSRAMSBRetention
  * @note   When this bit is set, the backup ram is supplied from backup regulator in Standby and
  *         VBAT modes.
  *         When this bit is reset, the backup ram can still be used in Run and Stop modes,
  *         but its content is lost in Standby and VBAT modes.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBkpSRAMSBRetention(void)
{
  SET_BIT(PWR->BDCR2, PWR_BDCR2_BKPRBSEN);
}

/**
  * @brief  Disable BKPSRAM retention in Standby mode.
  * @rmtoll BDCR2      BKPRBSEN           LL_PWR_DisableBkpSRAMSBRetention
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBkpSRAMSBRetention(void)
{
  CLEAR_BIT(PWR->BDCR2, PWR_BDCR2_BKPRBSEN);
}

