micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_pwr.h
/**
  * @brief  Check if the BKPSRAM retention in Standby mode is enabled
  * @rmtoll BDCR2      BKPRBSEN           LL_PWR_IsEnabledBkpSRAMSBRetention
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkpSRAMSBRetention(void)
{
  return ((READ_BIT(PWR->BDCR2, PWR_BDCR2_BKPRBSEN) == (PWR_BDCR2_BKPRBSEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable access to the backup domain
  * @rmtoll DBPCR      DBP             LL_PWR_EnableBkUpAccess
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBkUpAccess(void)
{
  SET_BIT(PWR->DBPCR, PWR_DBPCR_DBP);
}

/**
  * @brief  Disable access to the backup domain
  * @rmtoll DBPCR      DBP             LL_PWR_DisableBkUpAccess
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBkUpAccess(void)
{
  CLEAR_BIT(PWR->DBPCR, PWR_DBPCR_DBP);
}

/**
  * @brief  Check if the backup domain is enabled
  * @rmtoll DBPCR      DBP             LL_PWR_IsEnabledBkUpAccess
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpAccess(void)
{
  return ((READ_BIT(PWR->DBPCR, PWR_DBPCR_DBP) == (PWR_DBPCR_DBP)) ? 1UL : 0UL);
}

/**
  * @brief  Set the internal Regulator output voltage in STOP mode
  * @rmtoll CPUCR      SVOS            LL_PWR_SetStopModeRegulVoltageScaling
  * @param  VoltageScaling This parameter can be one of the following values:
  *         @arg @ref LL_PWR_REGU_STOP_VOLTAGE_SCALE3
  *         @arg @ref LL_PWR_REGU_STOP_VOLTAGE_SCALE5
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetStopModeRegulVoltageScaling(uint32_t VoltageScaling)
{
  MODIFY_REG(PWR->CPUCR, PWR_CPUCR_SVOS, VoltageScaling);
}

/**
  * @brief  Get the internal Regulator output voltage in STOP mode
  * @rmtoll CPUCR      SVOS            LL_PWR_GetStopModeRegulVoltageScaling
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_REGU_STOP_VOLTAGE_SCALE3
  *         @arg @ref LL_PWR_REGU_STOP_VOLTAGE_SCALE5
  */
__STATIC_INLINE uint32_t LL_PWR_GetStopModeRegulVoltageScaling(void)
{
  return READ_BIT(PWR->CPUCR, PWR_CPUCR_SVOS);
}

/**
  * @brief  Set the Power Down mode when device enters deepsleep mode
  * @rmtoll CPUCR      PDDS            LL_PWR_SetPowerDownModeDS
  * @param  PDMode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_POWERDOWN_MODE_DS_STOP
  *         @arg @ref LL_PWR_POWERDOWN_MODE_DS_STANDBY
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPowerDownModeDS(uint32_t PDMode)
{
  MODIFY_REG(PWR->CPUCR, PWR_CPUCR_PDDS, PDMode);
}

/**
  * @brief  Get the Power Down mode when device enters deepsleep mode
  * @rmtoll CPUCR      PDDS            LL_PWR_GetPowerDownModeDS
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_POWERDOWN_MODE_DS_STOP
  *         @arg @ref LL_PWR_POWERDOWN_MODE_DS_STANDBY
  */
__STATIC_INLINE uint32_t LL_PWR_GetPowerDownModeDS(void)
{
  return (uint32_t)(READ_BIT(PWR->CPUCR, PWR_CPUCR_PDDS));
}

/**
  * @brief  Enable Vdd IO2 voltage supply
  * @rmtoll SVMCR3     VDDIO2SV        LL_PWR_EnableVddIO2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO2(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2SV);
}

/**
  * @brief  Disable Vdd IO2 voltage supply
  * @rmtoll SVMCR3     VDDIO2SV        LL_PWR_DisableVddIO2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO2(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2SV);
}

/**
  * @brief  Check if the Vdd IO2 voltage supply is enabled
  * @rmtoll SVMCR3     VDDIO2SV        LL_PWR_IsEnabledVddIO2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO2(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2SV) == (PWR_SVMCR3_VDDIO2SV)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd IO3 voltage supply
  * @rmtoll SVMCR3     VDDIO3SV        LL_PWR_EnableVddIO3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO3(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3SV);
}

/**
  * @brief  Disable Vdd IO3 voltage supply
  * @rmtoll SVMCR3     VDDIO3SV        LL_PWR_DisableVddIO3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO3(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3SV);
}

/**
  * @brief  Check if the Vdd IO3 voltage supply is enabled
  * @rmtoll SVMCR3     VDDIO3SV        LL_PWR_IsEnabledVddIO3
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO3(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3SV) == (PWR_SVMCR3_VDDIO3SV)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd IO4 voltage supply
  * @rmtoll SVMCR1     VDDIO4SV        LL_PWR_EnableVddIO4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO4(void)
{
  SET_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4SV);
}

/**
  * @brief  Disable Vdd IO4 voltage supply
  * @rmtoll SVMCR1     VDDIO4SV        LL_PWR_DisableVddIO4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO4(void)
{
  CLEAR_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4SV);
}

/**
  * @brief  Check if the Vdd IO4 voltage supply is enabled
  * @rmtoll SVMCR1     VDDIO4SV        LL_PWR_IsEnabledVddIO4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO4(void)
{
  return ((READ_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4SV) == (PWR_SVMCR1_VDDIO4SV)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd IO5 voltage supply
  * @rmtoll SVMCR2     VDDIO5SV        LL_PWR_EnableVddIO5
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO5(void)
{
  SET_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5SV);
}

/**
  * @brief  Disable Vdd IO5 voltage supply
  * @rmtoll SVMCR2     VDDIO5SV        LL_PWR_DisableVddIO5
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO5(void)
{
  CLEAR_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5SV);
}

/**
  * @brief  Check if the Vdd IO5 voltage supply is enabled
  * @rmtoll SVMCR2     VDDIO5SV        LL_PWR_IsEnabledVddIO5
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO5(void)
{
  return ((READ_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5SV) == (PWR_SVMCR2_VDDIO5SV)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd USB voltage supply
  * @rmtoll SVMCR3     USB33SV         LL_PWR_EnableVddUSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddUSB(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33SV);
}

/**
  * @brief  Disable Vdd USB voltage supply
  * @rmtoll SVMCR3     USB33SV         LL_PWR_DisableVddUSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddUSB(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33SV);
}

/**
  * @brief  Check if the Vdd USB voltage supply is enabled
  * @rmtoll SVMCR3     USB33SV         LL_PWR_IsEnabledVddUSB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddUSB(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33SV) == (PWR_SVMCR3_USB33SV)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd ADC voltage supply
  * @rmtoll SVMCR3     ASV             LL_PWR_EnableVddADC
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddADC(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_ASV);
}

/**
  * @brief  Disable Vdd ADC voltage supply
  * @rmtoll SVMCR3     ASV             LL_PWR_DisableVddADC
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddADC(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_ASV);
}

/**
  * @brief  Check if the Vdd ADC voltage supply is enabled
  * @rmtoll SVMCR3     ASV             LL_PWR_IsEnabledVddADC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddADC(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_ASV) == (PWR_SVMCR3_ASV)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd IO2 voltage monitoring
  * @rmtoll SVMCR3     VDDIO2VMEN      LL_PWR_EnableVddIO2Monitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO2Monitoring(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VMEN);
}

/**
  * @brief  Disable Vdd IO2 voltage monitoring
  * @rmtoll SVMCR3     VDDIO2VMEN      LL_PWR_DisableVddIO2Monitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO2Monitoring(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VMEN);
}

/**
  * @brief  Check if the Vdd IO2 voltage monitoring is enabled
  * @rmtoll SVMCR3     VDDIO2VMEN      LL_PWR_IsEnabledVddIO2Monitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO2Monitoring(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VMEN) == (PWR_SVMCR3_VDDIO2VMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd IO3 voltage monitoring
  * @rmtoll SVMCR3     VDDIO3VMEN      LL_PWR_EnableVddIO3Monitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO3Monitoring(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VMEN);
}

/**
  * @brief  Disable Vdd IO3 voltage monitoring
  * @rmtoll SVMCR3     VDDIO3VMEN      LL_PWR_DisableVddIO3Monitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO3Monitoring(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VMEN);
}

/**
  * @brief  Check if the Vdd IO3 voltage monitoring is enabled
  * @rmtoll SVMCR3     VDDIO3VMEN      LL_PWR_IsEnabledVddIO3Monitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO3Monitoring(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VMEN) == (PWR_SVMCR3_VDDIO3VMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd IO4 voltage monitoring
  * @rmtoll SVMCR1     VDDIO4VMEN      LL_PWR_EnableVddIO4Monitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO4Monitoring(void)
{
  SET_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VMEN);
}

/**
  * @brief  Disable Vdd IO4 voltage monitoring
  * @rmtoll SVMCR1     VDDIO4VMEN      LL_PWR_DisableVddIO4Monitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO4Monitoring(void)
{
  CLEAR_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VMEN);
}

/**
  * @brief  Check if the Vdd IO4 voltage monitoring is enabled
  * @rmtoll SVMCR1     VDDIO4VMEN      LL_PWR_IsEnabledVddIO4Monitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO4Monitoring(void)
{
  return ((READ_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VMEN) == (PWR_SVMCR1_VDDIO4VMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd IO5 voltage monitoring
  * @rmtoll SVMCR2     VDDIO5VMEN      LL_PWR_EnableVddIO5Monitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO5Monitoring(void)
{
  SET_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VMEN);
}

/**
  * @brief  Disable Vdd IO5 voltage monitoring
  * @rmtoll SVMCR2     VDDIO5VMEN      LL_PWR_DisableVddIO5Monitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO5Monitoring(void)
{
  CLEAR_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VMEN);
}

/**
  * @brief  Check if the Vdd IO5 voltage monitoring is enabled
  * @rmtoll SVMCR2     VDDIO5VMEN      LL_PWR_IsEnabledVddIO5Monitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO5Monitoring(void)
{
  return ((READ_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VMEN) == (PWR_SVMCR2_VDDIO5VMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd ADC voltage monitoring
  * @rmtoll SVMCR3     AVMEN           LL_PWR_EnableVddADCMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddADCMonitoring(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_AVMEN);
}

/**
  * @brief  Disable Vdd ADC voltage monitoring
  * @rmtoll SVMCR3     AVMEN           LL_PWR_DisableVddADCMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddADCMonitoring(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_AVMEN);
}

/**
  * @brief  Check if the Vdd ADC voltage monitoring is enabled
  * @rmtoll SVMCR3     AVMEN           LL_PWR_IsEnabledVddADCMonitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddADCMonitoring(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_AVMEN) == (PWR_SVMCR3_AVMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd USB voltage monitoring
  * @rmtoll SVMCR3     USB33VMEN       LL_PWR_EnableVddUSBMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddUSBMonitoring(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33VMEN);
}

/**
  * @brief  Disable Vdd USB voltage monitoring
  * @rmtoll SVMCR3     USB33VMEN       LL_PWR_DisableVddUSBMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddUSBMonitoring(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33VMEN);
}

/**
  * @brief  Check if the Vdd USB voltage monitoring is enabled
  * @rmtoll SVMCR3     USB33VMEN       LL_PWR_IsEnabledVddUSBMonitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddUSBMonitoring(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33VMEN) == (PWR_SVMCR3_USB33VMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the VDD I/O voltage range
  * @rmtoll SVMCR3     VDDIOVRSEL      LL_PWR_SetVddIOVoltageRange
  * @param  VoltageRange This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  * @note   HSLV_VDD option bit must be set to allow 1v8 voltage range
  *         operation.
  *         Setting this configuration while VDD is in 3v3 range damages the device.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetVddIOVoltageRange(uint32_t VoltageRange)
{
  MODIFY_REG(PWR->SVMCR3, PWR_SVMCR3_VDDIOVRSEL, (VoltageRange << PWR_SVMCR3_VDDIOVRSEL_Pos));
}

/**
  * @brief  Get the VDD IO voltage range
  * @rmtoll SVMCR3     VDDIOVRSEL      LL_PWR_GetVddIOVoltageRange
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  */
__STATIC_INLINE uint32_t LL_PWR_GetVddIOVoltageRange(void)
{
  return (uint32_t)(READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIOVRSEL) >> PWR_SVMCR3_VDDIOVRSEL_Pos);
}

/**
  * @brief  Set the VDD IO2 voltage range
  * @rmtoll SVMCR3     VDDIO2VRSEL     LL_PWR_SetVddIO2VoltageRange
  * @param  VoltageRange This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  * @note   HSLV_VDD option bit must be set to allow 1v8 voltage range
  *         operation.
  *         Setting this configuration while VDD is in 3v3 range damages the device.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetVddIO2VoltageRange(uint32_t VoltageRange)
{
  MODIFY_REG(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VRSEL, (VoltageRange << PWR_SVMCR3_VDDIO2VRSEL_Pos));
}

/**
  * @brief  Get the VDD IO2 voltage range
  * @rmtoll SVMCR3     VDDIO2VRSEL     LL_PWR_GetVddIO2VoltageRange
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  */
__STATIC_INLINE uint32_t LL_PWR_GetVddIO2VoltageRange(void)
{
  return (uint32_t)(READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VRSEL) >> PWR_SVMCR3_VDDIO2VRSEL_Pos);
}

/**
  * @brief  Set the VDD IO3 voltage range
  * @rmtoll SVMCR3     VDDIO3VRSEL     LL_PWR_SetVddIO3VoltageRange
  * @param  VoltageRange This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  * @note   HSLV_VDD option bit must be set to allow 1v8 voltage range
  *         operation.
  *         Setting this configuration while VDD is in 3v3 range damages the device.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetVddIO3VoltageRange(uint32_t VoltageRange)
{
  MODIFY_REG(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VRSEL, (VoltageRange << PWR_SVMCR3_VDDIO3VRSEL_Pos));
}

/**
  * @brief  Get the VDD IO3 voltage range
  * @rmtoll SVMCR3     VDDIO3VRSEL     LL_PWR_GetVddIO3VoltageRange
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  */
__STATIC_INLINE uint32_t LL_PWR_GetVddIO3VoltageRange(void)
{
  return (uint32_t)(READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VRSEL) >> PWR_SVMCR3_VDDIO3VRSEL_Pos);
}

/**
  * @brief  Set the VDD IO4 voltage range
  * @rmtoll SVMCR1     VDDIO4VRSEL     LL_PWR_SetVddIO4VoltageRange
  * @param  VoltageRange This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  * @note   HSLV_VDD option bit must be set to allow 1v8 voltage range
  *         operation.
  *         Setting this configuration while VDD is in 3v3 range damages the device.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetVddIO4VoltageRange(uint32_t VoltageRange)
{
  MODIFY_REG(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSEL, (VoltageRange << PWR_SVMCR1_VDDIO4VRSEL_Pos));
}

/**
  * @brief  Get the VDD IO4 voltage range
  * @rmtoll SVMCR1     VDDIO4VRSEL     LL_PWR_GetVddIO4VoltageRange
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  */
__STATIC_INLINE uint32_t LL_PWR_GetVddIO4VoltageRange(void)
{
  return (uint32_t)(READ_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSEL) >> PWR_SVMCR1_VDDIO4VRSEL_Pos);
}

/**
  * @brief  Set the VDD IO5 voltage range
  * @rmtoll SVMCR2     VDDIO5VRSEL     LL_PWR_SetVddIO5VoltageRange
  * @param  VoltageRange This parameter can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  * @note   HSLV_VDD option bit must be set to allow 1v8 voltage range
  *         operation.
  *         Setting this configuration while VDD is in 3v3 range damages the device.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetVddIO5VoltageRange(uint32_t VoltageRange)
{
  MODIFY_REG(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSEL, (VoltageRange << PWR_SVMCR2_VDDIO5VRSEL_Pos));
}

/**
  * @brief  Get the VDD IO5 voltage range
  * @rmtoll SVMCR2     VDDIO5VRSEL     LL_PWR_GetVddIO5VoltageRange
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_3V3
  *         @arg @ref LL_PWR_VDDIO_VOLTAGE_RANGE_1V8
  */
__STATIC_INLINE uint32_t LL_PWR_GetVddIO5VoltageRange(void)
{
  return (uint32_t)(READ_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSEL) >> PWR_SVMCR2_VDDIO5VRSEL_Pos);
}

/**
  * @brief  Enable Vdd IO4 voltage range retained in Standby mode
  * @rmtoll SVMCR1     VDDIO4VRSTBY    LL_PWR_EnableVddIO4VoltageRangeSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO4VoltageRangeSB(void)
{
  SET_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSTBY);
}

/**
  * @brief  Disable Vdd IO4 voltage range retained in Standby mode
  * @rmtoll SVMCR1     VDDIO4VRSTBY    LL_PWR_DisableVddIO4VoltageRangeSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO4VoltageRangeSB(void)
{
  CLEAR_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSTBY);
}

/**
  * @brief  Check if the Vdd IO4 voltage range retained in Standby mode  is enabled
  * @rmtoll SVMCR1     VDDIO4VRSTBY    LL_PWR_IsEnabledVddIO4VoltageRangeSB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO4VoltageRangeSB(void)
{
  return ((READ_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSTBY) == (PWR_SVMCR1_VDDIO4VRSTBY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Vdd IO5 voltage range retained in Standby mode
  * @rmtoll SVMCR2     VDDIO5VRSTBY    LL_PWR_EnableVddIO5VoltageRangeSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO5VoltageRangeSB(void)
{
  SET_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSTBY);
}

/**
  * @brief  Disable Vdd IO5 voltage range retained in Standby mode
  * @rmtoll SVMCR2     VDDIO5VRSTBY    LL_PWR_DisableVddIO5VoltageRangeSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO5VoltageRangeSB(void)
{
  CLEAR_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSTBY);
}

/**
  * @brief  Check if the Vdd IO5 voltage range retained in Standby mode  is enabled
  * @rmtoll SVMCR2     VDDIO5VRSTBY    LL_PWR_IsEnabledVddIO5VoltageRangeSB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO5VoltageRangeSB(void)
{
  return ((READ_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSTBY) == (PWR_SVMCR2_VDDIO5VRSTBY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the WakeUp PINx functionality
  * @rmtoll WKUPEPR    WKUPEN1         LL_PWR_EnableWakeUpPin\n
  *         WKUPEPR    WKUPEN2         LL_PWR_EnableWakeUpPin\n
  *         WKUPEPR    WKUPEN3         LL_PWR_EnableWakeUpPin\n
  *         WKUPEPR    WKUPEN4         LL_PWR_EnableWakeUpPin
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin(uint32_t WakeUpPin)
{
  SET_BIT(PWR->WKUPEPR, WakeUpPin);
}

/**
  * @brief  Disable the WakeUp PINx functionality
  * @rmtoll WKUPEPR   WKUPEN1          LL_PWR_DisableWakeUpPin\n
  *         WKUPEPR   WKUPEN2          LL_PWR_DisableWakeUpPin\n
  *         WKUPEPR   WKUPEN3          LL_PWR_DisableWakeUpPin\n
  *         WKUPEPR   WKUPEN4          LL_PWR_DisableWakeUpPin
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin(uint32_t WakeUpPin)
{
  CLEAR_BIT(PWR->WKUPEPR, WakeUpPin);
}

/**
  * @brief  Check if the WakeUp PINx functionality is enabled
  * @rmtoll WKUPEPR    WKUPEN1         LL_PWR_IsEnabledWakeUpPin\n
  *         WKUPEPR    WKUPEN2         LL_PWR_IsEnabledWakeUpPin\n
  *         WKUPEPR    WKUPEN3         LL_PWR_IsEnabledWakeUpPin\n
  *         WKUPEPR    WKUPEN4         LL_PWR_IsEnabledWakeUpPin
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin(uint32_t WakeUpPin)
{
  return ((READ_BIT(PWR->WKUPEPR, WakeUpPin) == (WakeUpPin)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Wake-Up pin polarity low for the event detection
  * @rmtoll WKUPEPR    WKUPP1          LL_PWR_SetWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP2          LL_PWR_SetWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP3          LL_PWR_SetWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP4          LL_PWR_SetWakeUpPinPolarityLow
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityLow(uint32_t WakeUpPin)
{
  SET_BIT(PWR->WKUPEPR, (WakeUpPin << PWR_WKUPEPR_WKUPP1_Pos));
}

/**
  * @brief  Set the Wake-Up pin polarity high for the event detection
  * @rmtoll WKUPEPR    WKUPP1          LL_PWR_SetWakeUpPinPolarityHigh\n
  *         WKUPEPR    WKUPP2          LL_PWR_SetWakeUpPinPolarityHigh\n
  *         WKUPEPR    WKUPP3          LL_PWR_SetWakeUpPinPolarityHigh\n
  *         WKUPEPR    WKUPP4          LL_PWR_SetWakeUpPinPolarityHigh
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityHigh(uint32_t WakeUpPin)
{
  CLEAR_BIT(PWR->WKUPEPR, (WakeUpPin << PWR_WKUPEPR_WKUPP1_Pos));
}

