micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_pwr.h
/**
  * @brief  Check if the Wake-Up pin polarity is low for event detection
  * @rmtoll WKUPEPR    WKUPP1          LL_PWR_IsWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP2          LL_PWR_IsWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP3          LL_PWR_IsWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP4          LL_PWR_IsWakeUpPinPolarityLow
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsWakeUpPinPolarityLow(uint32_t WakeUpPin)
{
  return ((READ_BIT(PWR->WKUPEPR, (WakeUpPin << PWR_WKUPEPR_WKUPP1_Pos)) == (WakeUpPin << PWR_WKUPEPR_WKUPP1_Pos)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Wake-Up pin Pull None
  * @rmtoll WKUPEPR    WKUPPUPD1       LL_PWR_SetWakeUpPinPullNone\n
  *         WKUPEPR    WKUPPUPD2       LL_PWR_SetWakeUpPinPullNone\n
  *         WKUPEPR    WKUPPUPD3       LL_PWR_SetWakeUpPinPullNone\n
  *         WKUPEPR    WKUPPUPD4       LL_PWR_SetWakeUpPinPullNone
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullNone(uint32_t WakeUpPin)
{
  MODIFY_REG(PWR->WKUPEPR, \
             (PWR_WKUPEPR_WKUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin)) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)), \
             (LL_PWR_WAKEUP_PIN_NOPULL << ((PWR_WKUPEPR_WKUPPUPD1_Pos + (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin))) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Set the Wake-Up pin Pull Up
  * @rmtoll WKUPEPR    WKUPPUPD1       LL_PWR_SetWakeUpPinPullUp\n
  *         WKUPEPR    WKUPPUPD2       LL_PWR_SetWakeUpPinPullUp\n
  *         WKUPEPR    WKUPPUPD3       LL_PWR_SetWakeUpPinPullUp\n
  *         WKUPEPR    WKUPPUPD4       LL_PWR_SetWakeUpPinPullUp
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullUp(uint32_t WakeUpPin)
{
  MODIFY_REG(PWR->WKUPEPR, \
             (PWR_WKUPEPR_WKUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin)) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)), \
             (LL_PWR_WAKEUP_PIN_PULLUP << ((PWR_WKUPEPR_WKUPPUPD1_Pos + (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin))) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Set the Wake-Up pin Pull Down
  * @rmtoll WKUPEPR    WKUPPUPD1       LL_PWR_SetWakeUpPinPullDown\n
  *         WKUPEPR    WKUPPUPD2       LL_PWR_SetWakeUpPinPullDown\n
  *         WKUPEPR    WKUPPUPD3       LL_PWR_SetWakeUpPinPullDown\n
  *         WKUPEPR    WKUPPUPD4       LL_PWR_SetWakeUpPinPullDown
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullDown(uint32_t WakeUpPin)
{
  MODIFY_REG(PWR->WKUPEPR, \
             (PWR_WKUPEPR_WKUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin)) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)), \
             (LL_PWR_WAKEUP_PIN_PULLDOWN << ((PWR_WKUPEPR_WKUPPUPD1_Pos + (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin))) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Get the Wake-Up pin pull
  * @rmtoll WKUPEPR    WKUPPUPD1       LL_PWR_GetWakeUpPinPull\n
  *         WKUPEPR    WKUPPUPD2       LL_PWR_GetWakeUpPinPull\n
  *         WKUPEPR    WKUPPUPD3       LL_PWR_GetWakeUpPinPull\n
  *         WKUPEPR    WKUPPUPD4       LL_PWR_GetWakeUpPinPull\
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_NOPULL
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULLUP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULLDOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPinPull(uint32_t WakeUpPin)
{
  uint32_t regValue = READ_BIT(PWR->WKUPEPR, (PWR_WKUPEPR_WKUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin)) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));

  return (uint32_t)(regValue >> ((PWR_WKUPEPR_WKUPPUPD1_Pos + (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(
                                                                 WakeUpPin))) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK));
}

/**
  * @}
  */

/** @defgroup PWR_LL_EF_FLAG_MANAGEMENT PWR FLAG Management
  * @{
  */

/**
  * @brief  Indicate whether the voltage level is ready for current actual used VOS
  * @rmtoll VOSCR        ACTVOSRDY     LL_PWR_IsActiveFlag_ACTVOSRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_ACTVOSRDY(void)
{
  return ((READ_BIT(PWR->VOSCR, PWR_VOSCR_ACTVOSRDY) == (PWR_VOSCR_ACTVOSRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether VDD voltage is below the selected PVD threshold
  * @rmtoll CR2        PVDO            LL_PWR_IsActiveFlag_PVDO
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_PVDO(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_PVDO) == (PWR_CR2_PVDO)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the VCORE level is above or below low threshold
  * @rmtoll CR3      VCOREL           LL_PWR_IsActiveFlag_VCOREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VCOREL(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_VCOREL) == (PWR_CR3_VCOREL)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the VCORE level is above or below high threshold
  * @rmtoll CR3      VCOREH           LL_PWR_IsActiveFlag_VCOREH
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VCOREH(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_VCOREH) == (PWR_CR3_VCOREH)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the Regulator is ready in the selected voltage range
  *         or if its output voltage is still changing to the required voltage level
  * @rmtoll VOSCR      VOSRDY          LL_PWR_IsActiveFlag_VOSRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VOSRDY(void)
{
  return ((READ_BIT(PWR->VOSCR, PWR_VOSCR_VOSRDY) == (PWR_VOSCR_VOSRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the VBAT level is above or below low threshold
  * @rmtoll BDCR1      VBATL           LL_PWR_IsActiveFlag_VBATL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VBATL(void)
{
  return ((READ_BIT(PWR->BDCR1, PWR_BDCR1_VBATL) == (PWR_BDCR1_VBATL)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the VBAT level is above or below high threshold
  * @rmtoll BDCR1      VBATH           LL_PWR_IsActiveFlag_VBATH
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VBATH(void)
{
  return ((READ_BIT(PWR->BDCR1, PWR_BDCR1_VBATH) == (PWR_BDCR1_VBATH)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the CPU temperature level is above or below low threshold
  * @rmtoll BDCR1      TEMPL           LL_PWR_IsActiveFlag_TEMPL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_TEMPL(void)
{
  return ((READ_BIT(PWR->BDCR1, PWR_BDCR1_TEMPL) == (PWR_BDCR1_TEMPL)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the CPU temperature level is above or below high threshold
  * @rmtoll BDCR1      TEMPH           LL_PWR_IsActiveFlag_TEMPH
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_TEMPH(void)
{
  return ((READ_BIT(PWR->BDCR1, PWR_BDCR1_TEMPH) == (PWR_BDCR1_TEMPH)) ? 1UL : 0UL);
}

/**
  * @brief  Get System Stop Flag
  * @rmtoll CPUCR      STOPF           LL_PWR_IsActiveFlag_STOP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_STOP(void)
{
  return ((READ_BIT(PWR->CPUCR, PWR_CPUCR_STOPF) == (PWR_CPUCR_STOPF)) ? 1UL : 0UL);
}

/**
  * @brief  Get System Standby Flag
  * @rmtoll CPUCR      SBF             LL_PWR_IsActiveFlag_SB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_SB(void)
{
  return ((READ_BIT(PWR->CPUCR, PWR_CPUCR_SBF) == (PWR_CPUCR_SBF)) ? 1UL : 0UL);
}

/**
  * @brief  Get VDDIO2 ready Flag
  * @rmtoll SVMCR3     VDDIO2RDY       LL_PWR_IsActiveFlag_VDDIO2RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VDDIO2RDY(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2RDY) == (PWR_SVMCR3_VDDIO2RDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get VDDIO3 ready Flag
  * @rmtoll SVMCR3     VDDIO3RDY       LL_PWR_IsActiveFlag_VDDIO3RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VDDIO3RDY(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3RDY) == (PWR_SVMCR3_VDDIO3RDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get VDDIO4 ready Flag
  * @rmtoll SVMCR1     VDDIO4RDY       LL_PWR_IsActiveFlag_VDDIO4RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VDDIO4RDY(void)
{
  return ((READ_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4RDY) == (PWR_SVMCR1_VDDIO4RDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get VDDIO5 ready Flag
  * @rmtoll SVMCR2     VDDIO5RDY       LL_PWR_IsActiveFlag_VDDIO5RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_VDDIO5RDY(void)
{
  return ((READ_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5RDY) == (PWR_SVMCR2_VDDIO5RDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get VDD ADC ready Flag
  * @rmtoll SVMCR3     ARDY            LL_PWR_IsActiveFlag_ARDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_ARDY(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_ARDY) == (PWR_SVMCR3_ARDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get VDD USB33 ready Flag
  * @rmtoll SVMCR3     USB33RDY        LL_PWR_IsActiveFlag_USB33RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_USB33RDY(void)
{
  return ((READ_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33RDY) == (PWR_SVMCR3_USB33RDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 1
  * @rmtoll WKUPSR     WKUPF1          LL_PWR_IsActiveFlag_WU1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU1(void)
{
  return ((READ_BIT(PWR->WKUPSR, PWR_WKUPSR_WKUPF1) == (PWR_WKUPSR_WKUPF1)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 2
  * @rmtoll WKUPSR     WKUPF2          LL_PWR_IsActiveFlag_WU2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU2(void)
{
  return ((READ_BIT(PWR->WKUPSR, PWR_WKUPSR_WKUPF2) == (PWR_WKUPSR_WKUPF2)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 3
  * @rmtoll WKUPSR     WKUPF3          LL_PWR_IsActiveFlag_WU3
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU3(void)
{
  return ((READ_BIT(PWR->WKUPSR, PWR_WKUPSR_WKUPF3) == (PWR_WKUPSR_WKUPF3)) ? 1UL : 0UL);
}

/**
  * @brief  Get Wake-up Flag 4
  * @rmtoll WKUPSR     WKUPF4          LL_PWR_IsActiveFlag_WU4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU4(void)
{
  return ((READ_BIT(PWR->WKUPSR, PWR_WKUPSR_WKUPF4) == (PWR_WKUPSR_WKUPF4)) ? 1UL : 0UL);
}

/**
  * @brief  Clear STOP and STANDBY and flags
  * @rmtoll CPUCR      CSSF            LL_PWR_ClearFlag_STOP_SB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_STOP_SB(void)
{
  SET_BIT(PWR->CPUCR, PWR_CPUCR_CSSF);
}

/**
  * @brief  Clear Wake-up Flag 1
  * @rmtoll WKUPCR     WKUPC1          LL_PWR_ClearFlag_WU1
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU1(void)
{
  WRITE_REG(PWR->WKUPCR, PWR_WKUPCR_WKUPC1);
}

/**
  * @brief  Clear Wake-up Flag 2
  * @rmtoll WKUPCR     WKUPC2          LL_PWR_ClearFlag_WU2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU2(void)
{
  WRITE_REG(PWR->WKUPCR, PWR_WKUPCR_WKUPC2);
}

/**
  * @brief  Clear Wake-up Flag 3
  * @rmtoll WKUPCR     WKUPC3          LL_PWR_ClearFlag_WU3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU3(void)
{
  WRITE_REG(PWR->WKUPCR, PWR_WKUPCR_WKUPC3);
}

/**
  * @brief  Clear Wake-up Flag 4
  * @rmtoll WKUPCR     WKUPC4          LL_PWR_ClearFlag_WU4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU4(void)
{
  WRITE_REG(PWR->WKUPCR, PWR_WKUPCR_WKUPC4);
}

/**
  * @brief  Clear all wake up flags.
  * @rmtoll WUSCR          WKUPC         LL_PWR_ClearFlag_WU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU(void)
{
  WRITE_REG(PWR->WKUPCR, PWR_WKUPCR_WKUPC);
}

/**
  * @}
  */

/** @defgroup PWR_LL_EF_ATTRIBUTE_MANAGEMENT PWR Attribute Management
  * @{
  */

/**
  * @brief  Configure privilege attribute mode.
  * @note   This API can be executed only by CPU in privilege mode.
  * @rmtoll PRIVCFGR   PRIV0           LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   PRIV1           LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   PRIV2           LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   PRIV3           LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   PRIV4           LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   PRIV5           LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   PRIV6           LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   PRIV7           LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   WKUPPRIV1       LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   WKUPPRIV2       LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   WKUPPRIV3       LL_PWR_ConfigPrivilege\n
  *         PRIVCFGR   WKUPPRIV4       LL_PWR_ConfigPrivilege
  * @param  PrivilegeConfig This parameter can be the full combination
  *         of the following values:
  *         @arg @ref LL_PWR_PRIV0_PRIV or LL_PWR_PRIV0_NPRIV
  *         @arg @ref LL_PWR_PRIV1_PRIV or LL_PWR_PRIV1_NPRIV
  *         @arg @ref LL_PWR_PRIV2_PRIV or LL_PWR_PRIV2_NPRIV
  *         @arg @ref LL_PWR_PRIV3_PRIV or LL_PWR_PRIV3_NPRIV
  *         @arg @ref LL_PWR_PRIV4_PRIV or LL_PWR_PRIV4_NPRIV
  *         @arg @ref LL_PWR_PRIV5_PRIV or LL_PWR_PRIV5_NPRIV
  *         @arg @ref LL_PWR_PRIV6_PRIV or LL_PWR_PRIV6_NPRIV
  *         @arg @ref LL_PWR_PRIV7_PRIV or LL_PWR_PRIV7_NPRIV
  *         @arg @ref LL_PWR_WAKEUP_PIN1_NPRIV or LL_PWR_WAKEUP_PIN1_PRIV
  *         @arg @ref LL_PWR_WAKEUP_PIN2_NPRIV or LL_PWR_WAKEUP_PIN2_PRIV
  *         @arg @ref LL_PWR_WAKEUP_PIN3_NPRIV or LL_PWR_WAKEUP_PIN3_PRIV
  *         @arg @ref LL_PWR_WAKEUP_PIN4_NPRIV or LL_PWR_WAKEUP_PIN4_PRIV
  * @retval None.
  */
__STATIC_INLINE void LL_PWR_ConfigPrivilege(uint32_t PrivilegeConfig)
{
  WRITE_REG(PWR->PRIVCFGR, PrivilegeConfig);
}

/**
  * @brief  Get privilege attribute configuration.
  * @rmtoll PRIVCFGR    PRIV0            LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    PRIV1            LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    PRIV2            LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    PRIV3            LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    PRIV4            LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    PRIV5            LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    PRIV6            LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    PRIV7            LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    WKUPPRIV1        LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    WKUPPRIV2        LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    WKUPPRIV3        LL_PWR_GetConfigPrivilege\n
  *         PRIVCFGR    WKUPPRIV4        LL_PWR_GetConfigPrivilege
  * @retval Returned value is the combination of the following values:
  *         @arg @ref LL_PWR_PRIV0_PRIV or LL_PWR_PRIV0_NPRIV
  *         @arg @ref LL_PWR_PRIV1_PRIV or LL_PWR_PRIV1_NPRIV
  *         @arg @ref LL_PWR_PRIV2_PRIV or LL_PWR_PRIV2_NPRIV
  *         @arg @ref LL_PWR_PRIV3_PRIV or LL_PWR_PRIV3_NPRIV
  *         @arg @ref LL_PWR_PRIV4_PRIV or LL_PWR_PRIV4_NPRIV
  *         @arg @ref LL_PWR_PRIV5_PRIV or LL_PWR_PRIV5_NPRIV
  *         @arg @ref LL_PWR_PRIV6_PRIV or LL_PWR_PRIV6_NPRIV
  *         @arg @ref LL_PWR_PRIV7_PRIV or LL_PWR_PRIV7_NPRIV
  *         @arg @ref LL_PWR_WAKEUP_PIN1_NPRIV or LL_PWR_WAKEUP_PIN1_PRIV
  *         @arg @ref LL_PWR_WAKEUP_PIN2_NPRIV or LL_PWR_WAKEUP_PIN2_PRIV
  *         @arg @ref LL_PWR_WAKEUP_PIN3_NPRIV or LL_PWR_WAKEUP_PIN3_PRIV
  *         @arg @ref LL_PWR_WAKEUP_PIN4_NPRIV or LL_PWR_WAKEUP_PIN4_PRIV
  */
__STATIC_INLINE uint32_t LL_PWR_GetConfigPrivilege(void)
{
  return (READ_REG(PWR->PRIVCFGR));
}

#if defined (__ARM_FEATURE_CMSE) &&  (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Configure secure attribute mode.
  * @note   This API can be executed only by CPU in secure mode.
  * @rmtoll SECCFGR    SEC0            LL_PWR_ConfigSecure\n
  *         SECCFGR    SEC1            LL_PWR_ConfigSecure\n
  *         SECCFGR    SEC2            LL_PWR_ConfigSecure\n
  *         SECCFGR    SEC3            LL_PWR_ConfigSecure\n
  *         SECCFGR    SEC4            LL_PWR_ConfigSecure\n
  *         SECCFGR    SEC5            LL_PWR_ConfigSecure\n
  *         SECCFGR    SEC6            LL_PWR_ConfigSecure\n
  *         SECCFGR    SEC7            LL_PWR_ConfigSecure\n
  *         SECCFGR    WKUPSEC1        LL_PWR_ConfigSecure\n
  *         SECCFGR    WKUPSEC2        LL_PWR_ConfigSecure\n
  *         SECCFGR    WKUPSEC3        LL_PWR_ConfigSecure\n
  *         SECCFGR    WKUPSEC4        LL_PWR_ConfigSecure
  * @param  SecureConfig This parameter can be the full combination
  *         of the following values:
  *         @arg @ref LL_PWR_SEC0_SEC or LL_PWR_SEC0_NSEC
  *         @arg @ref LL_PWR_SEC1_SEC or LL_PWR_SEC1_NSEC
  *         @arg @ref LL_PWR_SEC2_SEC or LL_PWR_SEC2_NSEC
  *         @arg @ref LL_PWR_SEC3_SEC or LL_PWR_SEC3_NSEC
  *         @arg @ref LL_PWR_SEC4_SEC or LL_PWR_SEC4_NSEC
  *         @arg @ref LL_PWR_SEC5_SEC or LL_PWR_SEC5_NSEC
  *         @arg @ref LL_PWR_SEC6_SEC or LL_PWR_SEC6_NSEC
  *         @arg @ref LL_PWR_SEC7_SEC or LL_PWR_SEC7_NSEC
  *         @arg @ref LL_PWR_WAKEUP_PIN1_NSEC or LL_PWR_WAKEUP_PIN1_SEC
  *         @arg @ref LL_PWR_WAKEUP_PIN2_NSEC or LL_PWR_WAKEUP_PIN2_SEC
  *         @arg @ref LL_PWR_WAKEUP_PIN3_NSEC or LL_PWR_WAKEUP_PIN3_SEC
  *         @arg @ref LL_PWR_WAKEUP_PIN4_NSEC or LL_PWR_WAKEUP_PIN4_SEC
  * @retval None.
  */
__STATIC_INLINE void LL_PWR_ConfigSecure(uint32_t SecureConfig)
{
  WRITE_REG(PWR->SECCFGR, SecureConfig);
}

/**
  * @brief  Get secure attribute configuration.
  * @note   This API can be executed only by CPU in secure mode.
  * @rmtoll SECCFGR    SEC0            LL_PWR_GetConfigSecure\n
  *         SECCFGR    SEC1            LL_PWR_GetConfigSecure\n
  *         SECCFGR    SEC2            LL_PWR_GetConfigSecure\n
  *         SECCFGR    SEC3            LL_PWR_GetConfigSecure\n
  *         SECCFGR    SEC4            LL_PWR_GetConfigSecure\n
  *         SECCFGR    SEC5            LL_PWR_GetConfigSecure\n
  *         SECCFGR    SEC6            LL_PWR_GetConfigSecure\n
  *         SECCFGR    SEC7            LL_PWR_GetConfigSecure\n
  *         SECCFGR    WKUPSEC1        LL_PWR_GetConfigSecure\n
  *         SECCFGR    WKUPSEC2        LL_PWR_GetConfigSecure\n
  *         SECCFGR    WKUPSEC3        LL_PWR_GetConfigSecure\n
  *         SECCFGR    WKUPSEC4        LL_PWR_GetConfigSecure
  * @retval Returned value is the combination of the following values:
  *         @arg @ref LL_PWR_SEC0_SEC or LL_PWR_SEC0_NSEC
  *         @arg @ref LL_PWR_SEC1_SEC or LL_PWR_SEC1_NSEC
  *         @arg @ref LL_PWR_SEC2_SEC or LL_PWR_SEC2_NSEC
  *         @arg @ref LL_PWR_SEC3_SEC or LL_PWR_SEC3_NSEC
  *         @arg @ref LL_PWR_SEC4_SEC or LL_PWR_SEC4_NSEC
  *         @arg @ref LL_PWR_SEC5_SEC or LL_PWR_SEC5_NSEC
  *         @arg @ref LL_PWR_SEC6_SEC or LL_PWR_SEC6_NSEC
  *         @arg @ref LL_PWR_SEC7_SEC or LL_PWR_SEC7_NSEC
  *         @arg @ref LL_PWR_WAKEUP_PIN1_NSEC or LL_PWR_WAKEUP_PIN1_SEC
  *         @arg @ref LL_PWR_WAKEUP_PIN2_NSEC or LL_PWR_WAKEUP_PIN2_SEC
  *         @arg @ref LL_PWR_WAKEUP_PIN3_NSEC or LL_PWR_WAKEUP_PIN3_SEC
  *         @arg @ref LL_PWR_WAKEUP_PIN4_NSEC or LL_PWR_WAKEUP_PIN4_SEC
  */
__STATIC_INLINE uint32_t LL_PWR_GetConfigSecure(void)
{
  return (READ_REG(PWR->SECCFGR));
}
#endif /* defined (__ARM_FEATURE_CMSE) &&  (__ARM_FEATURE_CMSE == 3U) */
/**
  * @}
  */

#if defined (USE_FULL_LL_DRIVER)
/** @defgroup PWR_LL_EF_Init De-initialization function
  * @{
  */
ErrorStatus LL_PWR_DeInit(void);
/**
  * @}
  */
#endif /* defined (USE_FULL_LL_DRIVER) */
/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (PWR) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32N6xx_LL_PWR_H */

